Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCuttingSurfaceGeneralProblem Property
 Cannot process a surface-based splitter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceCuttingSurfaceGeneralProblem { get; }
Public Shared ReadOnly Property DividedSurfaceCuttingSurfaceGeneralProblem As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceCuttingSurfaceGeneralProblem {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceCuttingSurfaceGeneralProblem : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace